modules/Job/Blocks/ListJob.php

select * from `bravo_locations` where `bravo_locations`.`id` in (1, 10, 20) and `bravo_locations`.`deleted_at` is null
select `bravo_jobs`.* from `bravo_jobs` where `bravo_jobs`.`status` = 'publish' and `bravo_jobs`.`deleted_at` is null group by `bravo_jobs`.`id` order by `bravo_jobs`.`id` desc limit 5
---
    public function query($model){
        $model_Job = Job::select("bravo_jobs.*")->with(['location','translations','hasWishList']);
        if(empty($model['order'])) $model['order'] = "id";
        if(empty($model['order_by'])) $model['order_by'] = "desc";
        if(empty($model['number'])) $model['number'] = 5;
        if (!empty($model['location_id'])) {
            $location = Location::where('id', $model['location_id'])->where("status","publish")->first();
            if(!empty($location)){
                $model_Job->join('bravo_locations', function ($join) use ($location) {
                    $join->on('bravo_locations.id', '=', 'bravo_jobs.location_id')
                        ->where('bravo_locations._lft', '>=', $location->_lft)
                        ->where('bravo_locations._rgt', '<=', $location->_rgt);
                });
            }
        }
        $model_Job->orderBy("bravo_jobs.".$model['order'], $model['order_by']);
        $model_Job->where("bravo_jobs.status", "publish");
        $model_Job->with('location');
        $model_Job->groupBy("bravo_jobs.id");
        return $model_Job->limit($model['number'])->get();