modules/Job/Admin/JobController.php

    public function index(Request $request)
    {
        $this->checkPermission('job_view');
        $query = $this->JobClass::query() ;
        $query->orderBy('id', 'desc');
        if (!empty($job_name = $request->input('s'))) {
            $query->where('title', 'LIKE', '%' . $job_name . '%');
            $query->orderBy('title', 'asc');
        }
        if ($this->hasPermission('job_manage_others')) {
            if (!empty($author = $request->input('vendor_id'))) {
                $query->where('create_user', $author);
            }
        } else {
            $query->where('create_user', Auth::id());
        }
        $data = [
            'rows'               => $query->with(['author'])->paginate(20),
            'job_manage_others' => $this->hasPermission('job_manage_others'),
            'breadcrumbs'        => [
                [
                    'name' => __('Jobs'),
                    'url'  => 'admin/module/Job'
                ],
                [
                    'name'  => __('All'),
                    'class' => 'active'
                ],
            ],
            'page_title'=>__("Job Management")
        ];
---
select * from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null