modules/Core/Admin/SettingsController.php

                foreach ($keys as $key) {
                    $setting_key = $key.($lang ? '_'.$lang : '');

                    $check = Settings::where('name', $setting_key)->first();
---
select * from `core_settings` where `name` = 'site_title' limit 1